In [1]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
   'name':['george','pranjal','mayank','rajjwal','divya'],
   'marks':[99,95,98,96,84],
   'city':['prayahraj','mirzapur','allapur','daraganj','daraganj']
}

In [7]:
df=pd.dataframe(dict1)

AttributeError: module 'pandas' has no attribute 'dataframe'

In [8]:
df = pd.DataFrame(dict1)

In [11]:
df.head()

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur
2   mayank     98    allapur
3  rajjwal     96   daraganj
4    divya     84   daraganj

In [12]:
df.head(2)

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur

In [13]:
df.to_csv("firstcsv")

In [14]:
df.to_csv("csvfilew", index = false)

NameError: name 'false' is not defined